# DWGExportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWGExportOptions Constructor
DWGExportOptions Class See Also
---
Constructs a new instance of DWGExportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWGExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DWGExportOptions()
```

# See Also
DWGExportOptions Class
DWGExportOptions Overload
Autodesk.Revit.DB Namespace